-- translation for JoyPackage

return {
	["joy"] = "欢乐包",

	["shit"] = "屎",
	[":shit"] = "当此牌在<font color='red'><b>你的回合</b></font>内从你的<font color='red'>手牌</font>进入<font color='red'>弃牌堆</font>时，\
	你将受到自己对自己的1点伤害（黑桃为流失1点体力），其中方块为无属性伤害、梅花为雷电伤害、红桃为火焰伤害\
	造成伤害的牌为此牌，在你的回合内，你可多次食用",
	["$ShitLostHp"] = "%from 吃了 %card, 将流失1点体力",
	["$ShitDamage"] = "%from 吃了 %card, 将受到自己对自己的1点伤害",

-- disaster
	["disaster"] = "天灾包",

	["deluge"] = "洪水",
	[":deluge"] = "出牌阶段，将【洪水】放置于你的判定区里，回合判定阶段进行判定：若判定结果为 A,K，从当前角色的牌随机取出和场上存活人数相等的数量置于桌前，从下家开始，每人选一张收为手牌，将【洪水】置入弃牌堆。若判定结果不为AK，将【洪水】移到当前角色下家的判定区里",

	["typhoon"] = "台风",
	[":typhoon"] = "出牌阶段，将【台风】放置于你的判定区里，回合判定阶段进行判定：若判定结果为方块2~9之间，与当前角色距离为1的角色弃置6张手牌，将【台风】置入弃牌堆。若判定结果不为方块2~9之间，将【台风】移动到当前角色下家的判定区里",

	["earthquake"] = "地震",
	[":earthquake"] = "出牌阶段，将【地震】放置于你的判定区里，回合判定阶段进行判定：若判定结果为梅花2~9之间，与当前角色距离为1以内的角色(无视+1马)弃置装备区里的所有牌，将【地震】置入弃牌堆。若判定结果不为梅花2~9之间，将【地震】移动到当前角色下家的判定区里",

	["volcano"] = "火山",
	[":volcano"] = "出牌阶段，将【火山】放置于你的判定区里，回合判定阶段进行判定：若判定结果为红桃2~9之间，当前角色受到2点火焰伤害，与当前角色距离为1的角色(无视+1马)受到1点火焰伤害，【火山】生效后即置入弃牌堆。若判定结果不为红桃2~9之间，将【火山】移动到当前角色下家的判定区里",

	["mudslide"] = "泥石流",
	[":mudslide"] = "【泥石流】 延时锦囊\
出牌阶段，将【泥石流】放置于你的判定区里，回合判定阶段进行判定：若判定结果为黑桃或梅花A,K,4,7，从当前角色开始，每名角色依次按顺序弃置武器、防具、+1马、-1马，无装备者受到1点无属性伤害，当总共被弃置的装备达到4件或你上家结算完成时，【泥石流】停止结算并置入弃牌堆。若判定牌不为黑色AK47，将【泥石流】移动到下家的判定区里",

-- equips
	["joy_equip"] = "欢乐装备包",

	["monkey"] = "猴子",
	[":monkey"] = "装备后，当场上有其他角色使用【桃】时，你可以弃置【猴子】，阻止【桃】的结算并将其收为手牌",
	["grab_peach"] = "偷桃",

	["gale-shell"] = "狂风甲",
	[":gale-shell"] = "<b>锁定技</b>，每次受到火焰伤害时，该伤害+1；你可以将狂风甲装备和你距离为1以内的一名角色的装备区内",
	["#GaleShellDamage"] = "%from 装备【狂风甲】的效果被触发，由 %arg 点火焰伤害增加到 %arg2 点火焰伤害",

	["yx_sword"] = "杨修剑",
	[":yx_sword"] = "攻击范围：３<br/>当你的【杀】造成伤害时，可以指定攻击范围内的一名其他角色为伤害来源，杨修剑归该角色所有",

	
	["qx_knife"] = "七星刀",
	["geidao"] = "摸牌给刀",
	["shashang"] = "重置伤害",
	[":qx_knife"]="<font color=\"purple\"><b>攻击范围：2</b></font><br/>当你的【杀】造成伤害时，你可以选择一项\n★<font color=\"red\"><b>１</b></font>：防止此伤害，令攻击目标摸１张牌并获得七星刀\n★<font color=\"blue\"><b>２</b></font>：弃置七星刀，重置伤害为等同于攻击目标已损体力值的雷属性伤害",	
	["#QxKnifeEffect"] = "%from 的【七星刀】二效果被触发，弃置七星刀并重置伤害为%arg（雷属性）",

	
	["hxj"] = "护心镜",
	--[":hxj"]="<font color=\"purple\"><b>锁定技：</b></font><br/>★受到的雷属性伤害＋１\n★距离１以内的角色对你造成的非属性伤害无效\n★成为<font color=\"red\"><b>AOE</b></font>目标时，摸１张牌\n",	
	[":hxj"]="<font color=\"purple\"><b>锁定技：</b></font><br/>★受到的雷属性伤害+1\n★免疫AOE伤害并摸1张牌",
	["#HxjThunderEffect"] = "%from 的【护心镜】效果触发，受到的雷属性伤害点数由 %arg 提高至 %arg2",
	["#HxjDistanceEffect"] = "%from 的【护心镜】二效果被触发，本次对 %from 造成的伤害无效",
	["#HxjAoeEffect"] = "%from 的【护心镜】效果触发，阻止了AOE伤害并摸1张牌",
	
	["fiveline"] = "五道杠",
	[":fiveline"] = "<br><font color=blue>德杠</font>·体力为1时可以发动【仁德】<br><font color=green>智杠</font>·体力为2时可【集智】至多3次<br><font color=gold>体杠</font>·体力为3时可以发动【结姻】<br><font color=red>美杠</font>·体力为4时可以发动【国色】<br><font color=brown>劳杠</font>·体力为5时可以发动【苦肉】",
}
